acc
accept
acceptance
accepted
access
accessibility
account
accounting
action
actions
active
adapter
add
adjacent
adjustment
adjustments
adm
admin
affected
after
against
agent
aggregates
alignment
all
allow
allowed
allows
ambiguity
amoun
amount
amounts
amt
analysis
analyze
and
android
announcement
any
api
app
append
apply
approach
approved
apps
appwrite
architecture
are
args
aria
arong
array
assessment
assets
ast
async
attempt
attempts
attributes
attrs
audio
audit
auth
authed
authority
authorization
auto
automated
automatic
autonomous
availability
available
await
back
backend
background
backup
badge
balance
balances
band
banner
bar
base
based
baseline
bash
batch
before
behind
benchmark
bento
bhf
binding
blind
block
blocking
blocks
board
bodies
bolt
boolean
boom
bootstrap
bound
boundary
box
brainstorm
branch
breakdown
breakpoints
browser
bucket
budget
budgets
buffer
bug
build
builds
bundle
bundler
business
button
buttons
bypass
bypassing
cache
calculate
calculates
calculation
call
callback
callers
camera
campus
can
cancel
cancellation
candidate
capabilities
capability
card
case
cases
cash
cashflow
cashier
cat
catalog
catch
centralize
chain
change
changed
changes
changing
channel
check
checked
checkli
checklist
checkout
checkpoint
checks
cheerc
children
choice
chosen
chrome
chunk
chunks
class
classification
claude
clean
cleanup
clear
client
clone
close
closed
closeout
cloud
cloudflare
cluster
code
coding
cold
collection
collections
color
column
columns
com
command
commands
commit
commits
committed
committing
communities
community
comp
compatibility
compiler
complete
completed
completion
complex
complexity
compo
component
components
composite
composition
computer
concurrent
conditional
confidence
config
configuration
configure
configured
confirm
confirmation
confirmations
conflict
conformance
connected
considerations
consistency
consolidates
const
constants
constrain
constrained
constraint
constraints
constructor
consumer
consumers
container
contains
content
context
continue
contract
contrast
control
controlled
controller
controls
convert
converters
copy
core
corpus
correct
correction
corrections
corruption
cost
count
countdown
counted
counter
coverage
crash
create
creates
creation
criteria
critical
cross
csp
css
csv
current
cust
custom
customer
daily
damage
dangerous
dark
dashboard
dat
data
database
date
day
deactivation
deadlock
debounce
debt
decide
decision
decisions
default
defaults
defensive
defer
deferred
define
definition
definitions
delete
deleted
delta
dependencies
dependency
dependent
depl
deploy
deployment
deposit
derive
derived
describe
description
design
detail
details
detect
detected
detection
deterministic
dev
development
deviation
deviations
device
devices
diagnostic
diagnostics
dialog
did
diff
difference
differences
dim
dir
direct
direction
directory
dis
disab
disable
disabled
disconnection
discuss
discussion
display
disposition
div
doc
docs
document
documentation
dom
doma
domain
done
double
down
download
downtime
draft
drawer
drill
drills
dry
dual
duplicate
durable
dynamic
each
eager
earlier
easy
easyo
easyorder
echo
edge
edit
editing
effect
effective
element
email
emergency
emit
empty
emulator
emulators
enable
enabled
end
enforcement
engine
enhancement
enhancements
enqueue
enroll
enrolled
enrollment
ensure
enter
entities
entity
entry
env
environment
erasable
erro
error
errors
esc
escape
eslint
estimate
estimated
evaluation
event
events
evidence
exception
exclusion
exec
execution
executive
exist
existing
expanded
expanding
expansion
expect
expected
expense
experience
explain
exploration
export
exports
extends
extensions
extract
extracted
extraction
extras
face
facing
failed
failure
fake
fallback
fallthrough
false
favicon
feasibility
feature
fetch
field
fields
file
files
filter
filtering
final
financial
fir
fire
firebase
fires
firestore
firewall
first
fix
fixes
fixture
fixtures
flag
flaky
flapping
flash
flat
flatten
flex
flow
flush
fmt
focus
follow
font
food
for
force
foreground
form
formalization
formalize
formula
foundation
foundations
frame
free
freshness
friendly
fro
from
front
fronte
fronten
frontend
full
function
future
gap
gaps
gate
gcloud
gen
general
generate
get
getting
git
github
gitignore
given
global
globals
goal
goals
god
google
graph
graphify
graphml
green
grep
grid
group
grouped
groups
guard
guardrails
guards
guide
gzip
hand
handle
handler
handlers
handles
handling
handoff
hardening
hardware
has
have
header
headers
health
heavy
height
helpers
hero
high
hint
historical
history
hobby
home
honesty
hook
hooks
hosted
hosting
hotfix
hotkeys
hover
how
href
hsts
html
hub
husky
hydration
icon
icons
idempotency
identity
idle
image
images
img
immediate
immutable
impact
impl
implement
implementation
implicit
import
importing
imports
improvement
improvements
inactive
include
including
income
incremental
inde
index
indexed
indexes
indicator
info
infrastructure
initial
initialization
initialize
initialized
injection
input
install
installed
instead
instructions
int
integer
integrati
integration
integrity
intent
interaction
interface
internal
interpreter
into
inventory
invoked
involved
ipad
issue
issues
item
items
iza
jest
jsdom
json
jsonc
jsx
karaage
kbd
keep
key
keyboard
keydown
keys
kind
known
label
lan
lang
language
late
latency
layer
layers
layout
lazy
lbl
leaf
ledger
left
legacy
legal
level
lib
library
lifecycle
light
lightning
limit
line
lines
link
linkage
lint
list
liste
listeners
live
load
local
localhost
locals
lock
locked
locks
log
logger
logging
logic
logo
low
lower
lucide
lunch
machine
main
maintenance
major
make
managed
management
manifest
manual
mappers
mapping
markdown
marks
master
matrix
mcp
meal
meals
medium
memo
men
menu
menus
merge
merged
message
messages
metadata
midnight
migr
migra
migrat
migrate
migratio
migration
milestone
min
minor
missed
mistake
mitigations
mkdir
mock
mocks
modal
mode
model
models
modified
modify
module
modules
monday
monitoring
mono
monolith
monolithic
month
mouse
move
multi
multiple
must
mutation
name
native
nav
navigation
ndist
needed
neg
negative
neo
neon
net
netlify
network
new
newest
node
nodes
non
none
normal
normalization
normalize
not
note
notes
npm
npx
nqnfq
null
num
number
numeric
obj
object
objective
observability
observations
obsidian
obsolete
official
offline
offset
old
once
one
online
only
open
opening
opens
operating
operation
operational
operations
operator
operators
ops
opt
optimization
optimize
optional
options
orde
order
ordered
ordering
orders
orientation
other
out
outage
outbox
output
outputs
over
overlap
override
overrides
overview
owner
ownership
packa
package
pad
page
pages
paginate
paid
paint
panel
paper
parallel
parameters
parentheses
parse
parsing
part
parts
path
paths
pattern
patterns
pause
pay
payload
payloads
payment
payout
payroll
pdf
peak
pending
per
perf
performance
persist
persisted
persistence
persistent
petty
phase
phases
picked
pii
pilot
pipeline
pitfalls
placeholder
plan
planning
plans
platform
play
plugin
plus
pocket
points
policy
polish
polite
pollution
port
pos
position
positive
postgres
pre
preference
presentation
prettier
prev
preview
price
primary
primitive
primitives
principles
print
priority
privacy
private
probe
process
prod
product
production
profile
project
projection
projections
promote
promotional
prompt
prop
proposed
props
protection
protocol
prototype
prototyping
provider
proxy
pull
pure
purple
purpo
push
pwa
python
quality
quantity
query
question
queue
queueable
queued
quick
quiet
radio
range
rationale
reachability
react
read
readiness
readme
readonly
reads
ready
real
realtime
reason
recalculate
recalculation
receiver
receives
recent
reclose
recognition
recognizer
recommendation
recommended
reconnect
reconnection
record
records
recovery
redesign
reduce
reducer
reduction
ref
refactor
refactored
refactoring
reference
references
refresh
refund
regardless
regression
rel
related
relationship
relationships
release
remain
remaining
remains
remediation
remote
remove
render
rendering
reopen
repair
repeated
replace
replacement
repo
report
reporting
repositories
repository
request
required
reset
resolution
resolve
response
responsive
restore
result
retention
retest
retry
return
returns
reusable
review
revisions
rewrites
right
risk
risks
roadmap
role
rollback
rollup
root
roster
round
route
router
row
rows
rpt
rules
run
runbook
runbooks
runtime
safari
safe
safety
same
sample
sanitization
sanitize
save
scale
scan
scanned
scanner
scenario
schedule
schema
school
scope
screen
screens
script
scripts
search
secondary
secret
section
secu
security
seed
select
selected
selection
selector
selectors
self
semantic
semantics
sensitive
sensor
sentinel
separate
separation
serialize
serve
server
service
services
session
sessions
set
settings
settlemen
settlement
settlements
setup
severity
shallow
shape
sheet
sheets
shell
shift
short
shortcut
shortcuts
should
show
showing
sign
simplification
simplify
single
size
skeleton
skill
skip
slash
slice
slices
slider
slim
snapshot
software
sop
source
sources
spacing
span
spark
spec
specification
specifications
specs
split
splitting
spot
spots
sprite
sql
src
stability
stack
staff
stages
staging
start
started
starts
stat
state
states
static
stats
status
statuses
step
sto
stor
storage
store
stores
story
str
strategic
strategy
strict
strin
string
strip
structural
structure
stuck
student
students
style
styles
subagent
subagents
subcommands
subscribe
subscriptions
success
suggested
suggestions
suite
summarize
summary
sunday
supabase
superpowers
supersedes
support
surface
surfaces
suspense
svg
switch
syn
sync
synced
syntax
system
tab
table
tabs
talented
tap
target
task
tasks
technical
template
test
testing
tests
text
the
theme
then
these
thin
this
three
through
tier
time
timestamp
title
today
toggle
tok
token
tokens
tool
toolkit
tools
top
topup
total
totals
tou
touch
tracker
tracking
trail
training
trans
transac
transacti
transaction
transactions
transcribe
transport
trap
traversal
tree
trigger
true
truthful
tsc
tsconfig
tsx
turso
twa
tweak
tweaks
twk
type
typecheck
types
typescript
udq
uid
undo
uninstall
unit
unpaid
unsafe
unused
update
upgrade
upgrades
url
usability
usage
use
user
users
uses
using
utilities
utils
valid
validate
validation
validator
validators
value
variables
variant
vault
vendor
vendors
verbatim
vercel
verification
verify
version
versioned
versioning
via
video
view
virtual
virtualization
virtualize
visualizer
visuals
vit
vite
vitejs
vitest
vocab
voice
voiceover
void
vsl
waiting
warm
warning
warnings
was
watch
wave
wcag
web
webmanifest
welldone
what
whatever
when
whisper
whitelist
why
wiki
wildcard
window
wins
wire
wiring
with
without
wording
words
workbench
workbox
worker
workers
workflow
workflows
workspace
workspaces
wrapped
wrapper
writable
write
written
xss
yaml
yellow
yesterday
you
zero
zeroed
zustand
一人一單作業
一鍵全套
三等寬按鈕
上個月
上方的
下一個月
下午接手
下拉選單元件調整
不在本模組範圍
不需變更的檔案
不顯示
中櫃台收支重複標籤消除與完美的備註對齊
主任月底結算
主要問題
主頁面
互動規範
交易合併與分配邏輯
交易合併邏輯
交易清單
交易類型
人臉辨識
人臉辨識為
人臉辨識自動化
人臉辨識訂餐系統
今日便當設定
今日帳務報表切換視圖
今日帳本表格列對齊調整
今日帳看不到現金流記錄
今日帳與
今日帳顯示現金流記錄
今日設定頁面配置
今日開帳金額
仍要結帳
使用者故事
使用者的
依賴關係
便當統計
保留簡化版
修復與介面優化
修復規劃
修改檔案
修改的檔案
修改金額功能
修改開帳金額需跳出警示
修正流程
修訂版
個修復點
個檔案
個輸入框逐一驗證
側邊欄
備註前
備註輸入框不被
備註顯示位置與寬度
價格修改區域排版
價格修改區域排版優化與便當統計過濾
儲值金額
元件庫
元件更新
全型空白補滿
全測試鏈
共用資源警告
冗餘且低效的餘額重算邏輯
分階段修正計畫
切換模式後自動聚焦金額輸入框
列印格式定義
初始交易清空
刪除的檔案
前端部分
前置條件
功能描述
動態字體與高齡操作者模式
匯出相容性
卡片間距調整
原因選單支援鍵盤導航
取消聚焦
取消訂單
取消訂單後應回到首頁
可能受影響
可能透過
合併並部署
同時操作衝突
同步狀態
同步與離線
同步資料邊界
單元測試撰寫
單元測試更新
執行計畫書
基礎架構補強
報表公式
報表功能
報表區塊發生錯誤
報表與管理畫面語意化
報表與結算
多角色操作流程
大量訂單日
學生介面
學生已訂過便當
學生餘額全部歸零
完整檔案清單
完整流程
官方來源檢查於
官方參考來源
容量調整
實作任務
實作步驟
實作與規格差異
實作計畫
實作順序
實驗性代碼
實體數錢機整合
將產生欠款
專案新增單元測試覆蓋
對照驗證
對齊問題
展開後排版修正
已同步
已含於
已有基礎
已決議的設計問題
已確認
已訂便當份數計算錯誤
已訂過便當的學生再次選擇時預設繳費模式
已讀資料與現況
帳本分頁表格
帳本表格展開
常數與檢查基準
建立初始資料
建議下一步
建議檔案結構
建議狀態與型別
建議資料型別
影響範圍
後正確跳轉類型選擇
後的修復
從開機到一日營運
必須覆蓋
快捷鍵
快捷鍵修復
快捷鍵在收支介面應無效
快捷鍵衝突規則
快捷鍵進入收入
快速部署
所有數字輸入框僅接受正整數
手動驗收
手動驗證流程
打開瀏覽器
技術約束
拆分策略
按鈕快捷鍵提示
按鈕樣式與
按順序執行
接手未完成日結
搜尋框
搜尋框聚焦行為
搜尋框自動聚焦與
搜尋與
支出入口改為首頁按鈕
支出功能擴充為
支出模式
支出模式金額輸入框未顯示
收入流程不應共用支出
收入流程跳過
收支完成後狀態卡住
收支流程
收支流程修正
收支統一移至今日帳
收支記錄顯示備註前
收支重複標籤
收支金額
改名為
改本筆價格
改為切日
改進建議
敏感回應
整合測試
整數金額
數值輸入框
數值輸入框限制
數字鍵自動聚焦
文字不重疊
文字重疊
新增的檔案
新建檔案
新手合作社阿姨
方案設計
日期更新
日期範圍選
日結後發現錯帳
明文儲存學生
昨日關帳金額
更新機制
更正與作廢
最佳化
會計正確性
月份導覽缺少
有同步失敗或衝突記錄
未來後端錯誤日誌策略
本地照片註冊與建模
本日便當
本機上線後會同步
本次繳費
本筆價格
架構建議
核心交易邏輯
核心流程正式化
核心結論
根因分析
極簡化
櫃台收支正確顯示所有行
欄位外洩
次要問題
正式部署指南
歷史紀錄與切換日期
殘留的
每日現金對帳
每日開帳金額修改警示優化
每日開帳金額修改警示彈窗優化
測試範圍與指令
滾輪數值滾動阻擋與快捷鍵
漸進增強與優雅降級
無障礙與
獨立安全修正
現有實作對照
現況分析
現況說明
發現摘要與優先順序
目前主要缺口
目前錯誤處理缺口
相容性
移除收支和繳費下方的預設金額按鈕
移除虛擬化
移除訂餐
程式碼品質與重構執行計畫書
種子資料重設
第二輪測試修復
筆交易
筆交易未上傳
筆收入顯示為
筆顯示格式
系統會要求選擇正確版本
系統架構
系統設計規格書
紅色支出
純前端可完成
組件庫過於巨大且職責混雜
結帳明細
結帳明細簡化
結帳關帳與今日帳表優化
結帳關帳與帳本
綠色收入
網路頻繁斷線
縮減為
總交易筆數不包含未繳費訂單
總交易筆數修正
繳費金額
背景與現況問題
背景與目標
臨時替代人員
自動化測試
自動化測試狀態
自動遷移
自動遷移未實作
與交易完成
與交易資料
與使用者友善訊息
與其他模組的介面
與屬性傳遞
與測試矩陣
與版面排版
與版面排版調整
與跨平台支援策略實作計畫
色盲友善與
若其他裝置也關帳
虛擬鍵盤
衝突解決策略
補強計畫
裝置特定功能
規格有但尚未實作
觸控目標與焦點樣式
觸控與
觸控與手勢
觸控體驗實作計畫
訂購其他餐點
訂餐繳費
計算當日櫃台淨現金
設計決策
語意化
調整學生編號選擇下拉選單的滑鼠干擾行為
資料同步至
資料庫結構
資料遷移策略實作計畫
超出規格的實作
跨平台差異
跨日提醒
跨日操作
跨日期查詢
輸入備註後
輸入欄位佈局修正
輸入金額
返回上一層
返回上一層與
進行資料編輯
適配策略
邊界案例情境
邊界條件
邏輯滲透核心
部署步驟
部署與發行策略
重構步驟
重複的交易屬性推導
金流邏輯重設計
金流重設計後的
金額編輯入口
金額輸入焦點
錯誤分類
錯誤處理與復原策略實作計畫
鍵盤導航
鍵盤快捷鍵與輸入聚焦
鍵盤快捷鍵與輸入聚焦優化
鍵處理
開帳金額
開帳金額儲存一次後失效
開帳金額可重複儲存
開帳金額移到設定介面
開發與測試策略
關帳崩潰修復
關帳按鈕
關帳按鈕優化與缺失屬性修復
關帳時不再出現
關鍵問題
階段開發進度
隱私核心規範
隱私顯示
雙模快速搜尋
離線處理機制
離線關帳已先保存
離開焦點
需立即處理
需處理後才能關帳
需要硬體
非切月
非唯一資料源
預期異動與實作內容
預期行為
預設繳費模式
預設金額按鈕
額外標準
顏色統一
顯示方式調整需求與金流影響分析
顯示櫃台淨現金
顯示淨現金
顯示過濾與格式
顯示邏輯修正
風險在
風險與緩解
餘額雙重計算
首次開帳金額
驗收標準
驗證指令
驗證步驟
驗證清單
驗證計劃
驗證計畫
驗證部署